55/data/attachments/3733101b4dd76848.txt

INFO     root:api_helper.py:33 Пользователь David Wilson зарегистрирован
INFO     root:api_helper.py:33 Пользователь Luis Garza зарегистрирован
INFO     root:allure_helpers.py:82 

REQUEST POST http://localhost:8089/ws

REQUEST HEADERS {
  "User-Agent": "python-requests/2.32.3",
  "Accept-Encoding": "gzip, deflate",
  "Accept": "*/*",
  "Connection": "keep-alive",
  "Content-Type": "text/xml;charset=UTF-8",
  "Content-Length": "973"
}

REQUEST BODY <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:updateUserRequest>
            <nif:user>
                <nif:id>6e47e632-de2f-4935-a0e9-5e417406b5c5</nif:id>
                <nif:username>Luis Garza</nif:username>
                <!--Optional:-->
                <nif:firstname></nif:firstname>
                <!--Optional:-->
                <nif:surname></nif:surname>
                <!--Optional:-->
                <nif:fullname>Shirley West</nif:fullname>
                <nif:currency>KZT</nif:currency>
                <!--Optional:-->
                <nif:photo></nif:photo>
                <!--Optional:-->
                <nif:photoSmall></nif:photoSmall>
                <!--Optional:-->
                <nif:friendshipStatus></nif:friendshipStatus>
            </nif:user>
        </nif:updateUserRequest>
    </soapenv:Body>
</soapenv:Envelope>

RESPONSE HEADERS {
  "Accept": "text/xml, text/html, image/gif, image/jpeg, *; q=.2, */*; q=.2",
  "SOAPAction": "\"\"",
  "Content-Type": "text/xml;charset=utf-8",
  "Content-Length": "448",
  "Date": "Wed, 30 Jul 2025 15:16:00 GMT",
  "Keep-Alive": "timeout=60",
  "Connection": "keep-alive"
}

RESPONSE BODY b'<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:userResponse xmlns:ns2="niffler-userdata"><ns2:user><ns2:id>6e47e632-de2f-4935-a0e9-5e417406b5c5</ns2:id><ns2:username>Luis Garza</ns2:username><ns2:fullname>Shirley West</ns2:fullname><ns2:currency>KZT</ns2:currency><ns2:friendshipStatus>VOID</ns2:friendshipStatus></ns2:user></ns2:userResponse></SOAP-ENV:Body></SOAP-ENV:Envelope>'